function agecheck(age) {
    if (age > 18) {
        return true;
    } else {
        return alert("Родители должны разрешить вам использовать этот сайт");
    }
}


function agecheck(age) {
    return (age > 18) ? true : alert("Родители должны разрешить вам использовать этот сайт");
} // тернарный оператор позволяет сократить код, но может быть менее читаемым для некоторых разработчиков.



function agecheck(age) {
    return (age > 18) || alert("Родители должны разрешить вам использовать этот сайт");
} // использование логического оператора || позволяет сократить код еще больше, но может быть менее очевидным для понимания.



